#while ციკლით საპირისპირო მიმართულებით რიცხვები 20-იდან 0-მდე
num=20
while num>0:
    num=num-1
    print (num)

#while ციკლით მიმართულებით გადათვლა 1-დან 20-მდე მჯლადი ლუწი რიცხვები
num2=1
while num2>20:
    num2=num2 + 2
    print (num2)

#while ციკლით მიმართულებით გადათვლა 1-დან 100-მდე ყოველი 5-ის ჯამით რიცხვი
num3=1
while num3<100:
    num3=num3+5
    print (num3)



# შექმენით პროგრამა while ციკლის საშვალებით რომელიც გამოთვლის ყველა ნატურალური რიცხვის ჯამს 1-იდან 50-მდე
num4=1
while num4>50:
 num= num4+1
 print (num4)
