# შექმენით კალკულატორის პროგრამა სადაც მომხარებელი შემოიტანს ორ რიცხვს და 4 არითმეტიკული ოპერაციიდან ერთერთს. შეასრულეთ ამ ორ რიცხვს შორის არჩეული არითმეტიკული ოპერაცია

# 1) როგორ შემავატანონით მომხმარებელს მონაცემი პითონს?
#   ა) რომ შემოვატანინოთ მომხმარებელს მონაცემი უნდა გამოვიყენოთ input() ფუნქცია

# 2) რომელი არითმეტიკული ოპერაციები გვაქვს პითონში?
#   ა) +, -, *, /

# 3) როგორ ავირჩიოთ მოქმედება პირობაზე დაყრდნობით?
#   ა) უნდა გამოვიყენოთ if-elif-else განცხადებები 

num1 = int(input("Enter number 1: "))
num2 = int(input("Enter number 2: "))

operation = input("Enter an operator (+, -, *, /): ")

if operation == "+":
    print(num1 + num2)
elif operation == "-":
    print(num1 - num2)
elif operation == "*":
    print(num1 * num2)
elif operation == "/":
    print(num1 / num2)
else:
    print("Invalid operator!")

# input ყველა შეტანილ მნიშვნელობას ტერმინალიდან, აბრუნებს სტრინგის ფორმატში